SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_smbus.c
    if((I2C0 != periph) && (I2C1 != periph)){
        HAL_DEBUGE("parameter [periph] value is invalid"); 
        return HAL_ERR_VAL;
    }
    
    if(0 != smbus->periph){
        HAL_DEBUGI("periph value from smbus device struct has been rewrite");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    smbus->periph = periph;
    
    /* disable peripheral */
    i2c_disable(periph);
    
    i2c_clock_config(periph,p_init->clock_speed,I2C_DTCY_2);
    
    i2c_mode_addr_config(periph, I2C_SMBUSMODE_ENABLE, p_init->address_format, p_init->own_address1);
    
    /* configure dual-address mode */
    if (SMBUS_DUADEN_ENABLE == p_init->dual_address){
        i2c_dualaddr_enable(periph, p_init->own_address2);
    } else {
        i2c_dualaddr_disable(periph);
    }
    /* configure whether to stretch SCL low when data is not ready in slave mode */
    i2c_stretch_scl_low_config(periph, p_init->no_stretch);
    /* whether or not to response to a general call */
    i2c_slave_response_to_gcall_config(periph, p_init->general_call);
    
    i2c_smbus_type_config(periph, p_init->smbus_type);
    
    i2c_pec_enable(periph, p_init->smbus_pec);
    
    i2c_smbus_arp_enable(periph, p_init->smbus_arp);
        
    /* enable peripheral */
    i2c_enable(periph);
    /* enable acknowledge */
    i2c_ack_config(periph, SMBUS_ACK_ENABLE);
    
    smbus->tx_state = SMBUS_STATE_READY;
    smbus->rx_state = SMBUS_STATE_READY;
    
    return HAL_ERR_NONE;
}

/*!
    \brief      SMBUS evevt interrupt handler
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smbus_event_irq(hal_smbus_dev_struct *smbus)
{
    if(smbus->smbus_irq.event_handle != NULL){
        smbus->smbus_irq.event_handle(smbus);
    }
}

/*!
    \brief      SMBUS error interrupt handler
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smbus_error_irq(hal_smbus_dev_struct *smbus)
{
    /* PEC error */
    if(i2c_interrupt_flag_get(smbus->periph, I2C_INT_FLAG_PECERR) != RESET){
        i2c_interrupt_flag_clear(smbus->periph, I2C_INT_FLAG_PECERR);
        smbus->error_state |= HAL_SMBUS_ERROR_PECERR;
        smbus->last_error = HAL_SMBUS_ERROR_PECERR;
    }

    /* BERR error */
    if(i2c_interrupt_flag_get(smbus->periph, I2C_INT_FLAG_BERR) != RESET){
        i2c_interrupt_flag_clear(smbus->periph, I2C_INT_FLAG_BERR);
        smbus->error_state |= HAL_SMBUS_ERROR_BERR;
        smbus->last_error = HAL_SMBUS_ERROR_BERR;
    }

    /* LOSTARB error */
    if(i2c_interrupt_flag_get(smbus->periph, I2C_INT_FLAG_LOSTARB) != RESET){
        i2c_interrupt_flag_clear(smbus->periph, I2C_INT_FLAG_LOSTARB);
        smbus->error_state |= HAL_SMBUS_ERROR_LOSTARB;
        smbus->last_error = HAL_SMBUS_ERROR_LOSTARB;
    }

    /* AERR error */
    if(i2c_interrupt_flag_get(smbus->periph, I2C_INT_FLAG_AERR) != RESET){ 
        i2c_interrupt_flag_clear(smbus->periph, I2C_INT_FLAG_AERR);
        smbus->error_state |= HAL_SMBUS_ERROR_AERR;
        smbus->last_error = HAL_SMBUS_ERROR_AERR;
    }
    
    /* OUERR error */
    if(i2c_interrupt_flag_get(smbus->periph, I2C_INT_FLAG_OUERR) != RESET){ 
        i2c_interrupt_flag_clear(smbus->periph, I2C_INT_FLAG_OUERR);
        smbus->error_state |= HAL_SMBUS_ERROR_OUERR;
        smbus->last_error = HAL_SMBUS_ERROR_OUERR;
    }
    
    /* SMBUS timeout */
    if(i2c_interrupt_flag_get(smbus->periph, I2C_INT_FLAG_SMBTO) != RESET){ 
        i2c_interrupt_flag_clear(smbus->periph, I2C_INT_FLAG_SMBTO);
        smbus->error_state |= HAL_SMBUS_ERROR_SMBTO;
        smbus->last_error = HAL_SMBUS_ERROR_SMBTO;
    }
    
    /* SMBUS alert */
    if(i2c_interrupt_flag_get(smbus->periph, I2C_INT_FLAG_SMBALT) != RESET){ 
        i2c_interrupt_flag_clear(smbus->periph, I2C_INT_FLAG_SMBALT);
        smbus->error_state |= HAL_SMBUS_ERROR_SMBALT;
        smbus->last_error = HAL_SMBUS_ERROR_SMBALT;
    }
    
    /* SMBUS no error */
    if(smbus->error_state != HAL_SMBUS_ERROR_NONE){
        if(smbus->smbus_irq.error_handle != NULL){
            smbus->smbus_irq.error_handle(smbus);
            smbus->error_state = HAL_SMBUS_ERROR_NONE;
        }
    }
}

/*!
    \brief      start SMBUS module function
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     
*/
void hal_smbus_start(hal_smbus_dev_struct *smbus)
{
    i2c_enable(smbus->periph);
}

/*!
    \brief      stop SMBUS module function
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     
*/
void hal_smbus_stop(hal_smbus_dev_struct *smbus)
{
    i2c_disable(smbus->periph);
}

/*!
    \brief      set user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: the structure that contains callback handlers of SMBUS interrupt
    \param[out] none
    \retval     none
*/
void hal_smbus_irq_handle_set(hal_smbus_dev_struct *smbus, hal_smbus_irq_struct *p_irq)
{
    /* event handle */
    if(NULL != p_irq->event_handle){
        smbus->smbus_irq.event_handle = p_irq->event_handle;
        i2c_interrupt_enable(smbus->periph, I2C_INT_EV);
        i2c_interrupt_enable(smbus->periph, I2C_INT_BUF);
    }else{
        smbus->smbus_irq.event_handle = NULL;
        i2c_interrupt_disable(smbus->periph, I2C_INT_EV);
        i2c_interrupt_disable(smbus->periph, I2C_INT_BUF);
    }
    
    /* error handle */
    if(NULL != p_irq->error_handle){
        smbus->smbus_irq.error_handle = p_irq->error_handle;
        i2c_interrupt_enable(smbus->periph, I2C_INT_ERR);
    }else{
        smbus->smbus_irq.error_handle = NULL;
        i2c_interrupt_disable(smbus->periph, I2C_INT_ERR);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smbus_irq_handle_all_reset(hal_smbus_dev_struct *smbus)
{
    smbus->smbus_irq.event_handle = NULL;
    smbus->smbus_irq.error_handle = NULL;
}

/*!
    \brief      SMBUS master transmit in interrupt mode
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_smbus_master_transmit_interrupt(hal_smbus_dev_struct *smbus, uint8_t *p_buffer, \
                                     uint32_t length, hal_smbus_user_cb p_user_func)
{
    __IO uint32_t timeout_ms = HAL_TIMEOUT_FOREVER;
    
