SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_smbus.c
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == smbus) || (NULL == p_buffer) || (0 == length)){
        HAL_DEBUGE("parameter [smbus] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* SMBUS state is busy */
    if(SMBUS_STATE_BUSY == smbus->tx_state){
        HAL_DEBUGE("smbus tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* update the value of SMBUS dev struct */
    smbus->error_state = HAL_SMBUS_ERROR_NONE;
    smbus->txbuffer.buffer = (uint8_t *)p_buffer; 
    smbus->txbuffer.length = length;
    smbus->txbuffer.pos = 0;

    /* SMBUS state is ready */
    if(SMBUS_STATE_READY == smbus->tx_state){
        smbus->tx_state = SMBUS_STATE_BUSY;
        smbus->tx_callback = (void*)p_user_func;
        smbus->smbus_irq.event_handle = _smbus_master_transmit_interrupt;
        
        /* enable the I2C interrupt */
        i2c_interrupt_enable(smbus->periph, I2C_INT_BUF);
        i2c_interrupt_enable(smbus->periph, I2C_INT_EV);
        
        /* the master waits until the I2C bus is idle */
        if(HAL_ERR_NONE != _smbus_wait_flag_timeout(smbus->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }
        /* the master sends a start condition to I2C bus */
        i2c_start_on_bus(smbus->periph);
        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      SMBUS master receive with interrupt
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be read 
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_smbus_master_receive_interrupt(hal_smbus_dev_struct *smbus, uint8_t *p_buffer, \
                                    uint32_t length, hal_smbus_user_cb p_user_func)
{
    __IO uint32_t timeout_ms = HAL_TIMEOUT_FOREVER;
    
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == smbus) || (NULL == p_buffer) || (0 == length)){
        HAL_DEBUGE("parameter [smbus] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* SMBUS state is busy */
    if(SMBUS_STATE_BUSY == smbus->rx_state){
        HAL_DEBUGE("smbus tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* update the values of SMBUS dev struct */
    smbus->error_state = HAL_SMBUS_ERROR_NONE;
    smbus->rxbuffer.buffer = (uint8_t *)p_buffer; 
    smbus->rxbuffer.length = length;
    smbus->rxbuffer.pos = 0;

    /* SMBUS state is ready */
    if(SMBUS_STATE_READY == smbus->rx_state){
        /* wait until I2C bus is idle */
        if(HAL_ERR_NONE != _smbus_wait_flag_timeout(smbus->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }
        
        /* update the values of SMBUS dev struct */
        smbus->rx_state = SMBUS_STATE_BUSY;
        smbus->rx_callback = (void*)p_user_func;
        smbus->smbus_irq.event_handle = _smbus_master_receive_interrupt;
        
        /* enable the I2C interrupt */
        i2c_interrupt_enable(smbus->periph, I2C_INT_BUF);
        i2c_interrupt_enable(smbus->periph, I2C_INT_EV);
        
        /* wait until I2C bus is idle */
        if(HAL_ERR_NONE != _smbus_wait_flag_timeout(smbus->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }
        
        if(smbus->rxbuffer.length == 2){
            /* send a NACK for the next data byte which will be received into the shift register */
            i2c_ackpos_config(I2C0, I2C_ACKPOS_NEXT);
        }

        /* the master sends a start condition to I2C bus */
        i2c_start_on_bus(smbus->periph);
        
        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      SMBUS slave transmit in interrupt mode
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_smbus_slave_transmit_interrupt(hal_smbus_dev_struct *smbus, uint8_t *p_buffer, \
                                     uint32_t length, hal_smbus_user_cb p_user_func)
{
    __IO uint32_t timeout_ms = HAL_TIMEOUT_FOREVER;
    
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == smbus) || (NULL == p_buffer) || (0 == length)){
        HAL_DEBUGE("parameter [smbus] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* SMBUS state is busy */
    if(SMBUS_STATE_BUSY == smbus->tx_state){
        HAL_DEBUGE("smbus tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* update the values of SMBUS dev struct */
    smbus->error_state = HAL_SMBUS_ERROR_NONE;
    smbus->txbuffer.buffer = (uint8_t *)p_buffer; 
    smbus->txbuffer.length = length;
    smbus->txbuffer.pos = 0;

    /* SMBUS state is ready */
    if(SMBUS_STATE_READY == smbus->tx_state){
        if(HAL_ERR_NONE != _smbus_wait_flag_timeout(smbus->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }
        
