SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_smbus.c
        /* update the values of SMBUS dev struct */
        smbus->tx_state = SMBUS_STATE_BUSY;
        smbus->tx_callback = (void*)p_user_func;
        smbus->smbus_irq.event_handle = _smbus_slave_transmit_interrupt;
        
        /* enable the I2C interrupt */
        i2c_interrupt_enable(smbus->periph, I2C_INT_BUF);
        i2c_interrupt_enable(smbus->periph, I2C_INT_EV);
        
        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      SMBUS slave receive with interrupt
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be read 
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_smbus_slave_receive_interrupt(hal_smbus_dev_struct *smbus, uint8_t *p_buffer, \
                                    uint32_t length, hal_smbus_user_cb p_user_func)
{
    __IO uint32_t timeout_ms = HAL_TIMEOUT_FOREVER;
    
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == smbus) || (NULL == p_buffer) || (0 == length)){
        HAL_DEBUGE("parameter [smbus] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* SMBUS state is busy */
    if(SMBUS_STATE_BUSY == smbus->rx_state){
        HAL_DEBUGE("smbus tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* update the values of SMBUS dev struct */
    smbus->error_state = HAL_SMBUS_ERROR_NONE;
    smbus->rxbuffer.buffer = (uint8_t *)p_buffer; 
    smbus->rxbuffer.length = length;
    smbus->rxbuffer.pos = 0;

    /* SMBUS state is ready */
    if(SMBUS_STATE_READY == smbus->rx_state){
        if(HAL_ERR_NONE != _smbus_wait_flag_timeout(smbus->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }
        
        /* update the values of SMBUS dev struct */
        smbus->rx_state = SMBUS_STATE_BUSY;
        smbus->rx_callback = (void*)p_user_func;
        smbus->smbus_irq.event_handle = _smbus_slave_receive_interrupt;
        
        /* enable the I2C interrupt */
        i2c_interrupt_enable(smbus->periph, I2C_INT_BUF);
        i2c_interrupt_enable(smbus->periph, I2C_INT_EV);
        
        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      Enable the SMBUS alert mode with Interrupt.
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_smbus_enable_alert_interrupt(hal_smbus_dev_struct *smbus)
{
    /* Enable SMBus alert */
    i2c_smbus_issue_alert(smbus->periph,I2C_SALTSEND_ENABLE);

    /* Clear ALERT flag */
    i2c_flag_clear(smbus->periph,I2C_FLAG_SMBALT);

    /* Enable Alert Interrupt */
    i2c_interrupt_enable(smbus->periph,I2C_INT_ERR);

    return HAL_ERR_NONE;
}

/*!
    \brief      Disable the SMBUS alert mode with Interrupt.
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_smbus_disable_alert_interrupt(hal_smbus_dev_struct *smbus)
{
    /* Enable SMBus alert */
    i2c_smbus_issue_alert(smbus->periph,I2C_SALTSEND_DISABLE);

    /* Disable Alert Interrupt */
    i2c_interrupt_disable(smbus->periph,I2C_INT_ERR);

    return HAL_ERR_NONE;
}

/*!
    \brief      wait the flag status until timeout
    \param[in]  smbus_periph: I2Cx(x=0,1)
    \param[in]  flag: I2C flags, refer to i2c_flag_enum
    \param[in]  status: the status of I2C flag to wait 
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     none
*/
static int32_t _smbus_wait_flag_timeout(uint32_t smbus_periph, i2c_flag_enum flag, FlagStatus status, uint32_t timeout_ms)
{
    uint32_t tick_start = 0;
    
    tick_start = hal_basetick_count_get();
    /* wait flag status RESET */
    if(RESET == status){
        while(SET == i2c_flag_get(smbus_periph, flag)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("i2c get flag timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    }else{
        /* wait flag status SET */
        while(RESET == i2c_flag_get(smbus_periph, flag)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("i2c get flag timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      event handler in SMBUS master transmit mode
    \param[in]  smbus: SMBUS device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _smbus_master_transmit_interrupt(void *smbus)
{
    uint32_t length = 0;
    
    hal_smbus_dev_struct *p_smbus = smbus;
    hal_smbus_user_cb p_func = (hal_smbus_user_cb)p_smbus->tx_callback;
    
    length = p_smbus->txbuffer.length;
    
    if(i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_SBSEND)){
        /* send slave address */
        i2c_master_addressing(p_smbus->periph, p_smbus->slave_address, SMBUS_TRANSMITTER);
    }else if(i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_ADDSEND)){
        /*clear ADDSEND bit */
        i2c_interrupt_flag_clear(p_smbus->periph, I2C_INT_FLAG_ADDSEND);
    }else if(i2c_interrupt_flag_get(p_smbus->periph, I2C_INT_FLAG_TBE)){
        if(p_smbus->txbuffer.pos < length){
            /* transmit smbus data */
            i2c_data_transmit(p_smbus->periph, (*p_smbus->txbuffer.buffer & (uint8_t)0xFFU));
            
